Repository: murank/wxwidgetsjp
Catalog: wxwidgetsjp-level2.tmx
Source language: en_us
Languages: ja

source: // We want to get a dialog that is stretchable because it // has a text ctrl at the top and two buttons at the bottom. MyDialog::MyDialog(wxFrame *parent, wxWindowID id, const wxString &title ) : wxDialog(parent, id, title, wxDefaultPosition, wxDefaultSize,
ja: // 上部にテキストコントロールと下部にふたつのボタンを持つので // リサイズ可能なダイアログにしたい。 MyDialog::MyDialog(wxFrame *parent, wxWindowID id, const wxString &title ) : wxDialog(parent, id, title, wxDefaultPosition, wxDefaultSize,

source: // an easy and portable way to create a bitmap wxBitmap bmp(wxBITMAP(bmpname)); // which is roughly equivalent to the following #if defined(__WXMSW__) || defined(__WXPM__) wxBitmap bmp("bmpname", wxBITMAP_TYPE_BMP_RESOURCE); #else // Unix wxBitmap bmp(bmpname_xpm, wxBITMAP_TYPE_XPM); #endif
ja: // ビットマップを作成する、簡単で移植性のある方法 wxBitmap bmp(wxBITMAP(bmpname)); // これは以下のコードと大体同じです #if defined(__WXMSW__) || defined(__WXPM__) wxBitmap bmp("bmpname", wxBITMAP_TYPE_BMP_RESOURCE); #else // Unix wxBitmap bmp(bmpname_xpm, wxBITMAP_TYPE_XPM); #endif

source: // define a new event class class MyPlotEvent: public wxEvent { public:
ja: // 新しいイベントクラスを定義する class MyPlotEvent: public wxEvent { public:

source: // disable all database error messages, everybody knows databases never
ja: // 絶対にデータベースが失敗しないことを誰もが知っているため、

source: // first test, using exotic characters outside of the Unicode BMP:
ja: // 最初のテストでは Unicode BMP 外の文字を使用する:

source: // this function converts the input string to uppercase, // output it to the screen and returns the result const char *SayHELLO(const wxString& input) {
ja: // この関数は入力された文字列を大文字に変換し、画面に表示した上で // 結果を返却する const char *SayHELLO(const wxString& input) {

source: // this is typically in a header: it just declares MY_EVENT event type wxDECLARE_EVENT(MY_EVENT, wxCommandEvent); // this is a definition so can't be in a header wxDEFINE_EVENT(MY_EVENT, wxCommandEvent); // example of code handling the event with event tables wxBEGIN_EVENT_TABLE(MyFrame, wxFrame)
ja: // このマクロは一般的にヘッダファイル内で使用します: これは MY_EVENT イベント型を定義するだけです wxDECLARE_EVENT(MY_EVENT, wxCommandEvent); // これは定義なのでヘッダ内で使用することはできません wxDEFINE_EVENT(MY_EVENT, wxCommandEvent); // イベントテーブルによるイベント処理のコード例 wxBEGIN_EVENT_TABLE(MyFrame, wxFrame)

source: const char *p = s.ToUTF8(); ... puts(p); // or call any other function taking const char *
ja: const char *p = s.ToUTF8(); ... puts(p); // または const char * を受け取る他の関数の呼び出し

source: // also enable tracing messages from wxWidgets dynamic module loading
ja: // また、wxWidgets の動的モジュールロード機能の

source: // do nothing
ja: // 何も行わない

source: // mechanism
ja: // トレースメッセージも有効化する

source: // prints "wxString reports a length of 1 character(s)" on Linux
ja: // Linux では "wxString reports a length of 1 character(s)" と表示される

source: // prints "wxString reports a length of 2 character(s)" on Windows
ja: // Windows では "wxString reports a length of 2 character(s)" と表示される

source: // implement the base class pure virtual
ja: // 基底クラスの純粋仮想関数を実装する

source: // since wxString on Windows doesn't have surrogate pairs support!
ja: // これは Windows の wxString はサロゲートペアに対応していないからだ!

source: // second test, this time using characters part of the Unicode BMP:
ja: // ふたつ目のテストでは Unicode BMP の文字を使用する:

source: // it's common to call the event handlers OnSomething() but there is no
ja: // イベントハンドラは OnSomething() という名前にするのが一般的ですが、

source: // obligation to do that; this one is an event handler too:
ja: // そうしなければならないわけではありません； これもイベントハンドラです:

source: // this is the UTF8 encoding of capital letter A followed by
ja: // これは大文字の A、'グレーブ付きの小文字の a'、

source: // fail anyhow
ja: // データベースのすべてのエラーメッセージを無効化する

source: // 'small case letter a with grave' followed by the 'euro sign'
ja: // 'ユーロ記号' を UTF8 で符号化したもので、

source: // they are 3 Unicode code-points encoded as:
ja: // 3 個の Unicode コードポイントは次のように符号化される:

source: // - 3 UTF16 code units under Windows
ja: // - Windows では 3 個の UTF16 コード単位

source: // - 6 UTF8 code units under Linux
ja: // - Linux では 6 個の UTF8 コード単位

source: const wxPoint m_pos; }; // we define a single MY_PLOT_CLICKED event type associated with the class // above but typically you are going to have more than one event type, e.g. you // could also have MY_PLOT_ZOOMED or MY_PLOT_PANNED &c -- in which case you // would just add more similar lines here wxDEFINE_EVENT(MY_PLOT_CLICKED, MyPlotEvent); // if you want to support old compilers you need to use some ugly macros: typedef void (wxEvtHandler::*MyPlotEventFunction)(MyPlotEvent&); #define MyPlotEventHandler(func) wxEVENT_HANDLER_CAST(MyPlotEventFunction, func) // if your code is only built using reasonably modern compilers, you could just // do this instead: #define MyPlotEventHandler(func) (&func) // finally define a macro for creating the event table entries for the new // event type // // remember that you don't need this at all if you only use Bind<>() and that // you can replace MyPlotEventHandler(func) with just &func unless you use a // really old compiler #define MY_EVT_PLOT_CLICK(id, func) \ wx__DECLARE_EVT1(MY_PLOT_CLICKED, id, MyPlotEventHandler(func)) // example of code handling the event (you will use one of these methods, not // both, of course): wxBEGIN_EVENT_TABLE(MyFrame, wxFrame)
ja: const wxPoint m_pos; }; // 上記のクラスに関連する MY_PLOT_CLICKED イベント型をひとつだけ定義しますが、 // 通常は複数のイベント型を持つようになるでしょう。例えば、 // MY_PLOT_ZOOMED や MY_PLOT_PANNED などです。 // そのような場合はこれと似たような行をここに追加するだけです。 wxDEFINE_EVENT(MY_PLOT_CLICKED, MyPlotEvent); // 古いコンパイラをサポートしたい場合、いくつかの醜いマクロを使用する必要があります: typedef void (wxEvtHandler::*MyPlotEventFunction)(MyPlotEvent&); #define MyPlotEventHandler(func) wxEVENT_HANDLER_CAST(MyPlotEventFunction, func) // ほどほどにモダンなコンパイラのみでビルドする場合、 // 代わりに以下のようにするだけです: #define MyPlotEventHandler(func) (&func) // 最後に、新しいイベント型のイベントテーブルエントリを作成するマクロを // 定義します // // Bind<>() のみを使用する場合はこうする必要がまったくないことと、 // 本当に古いコンパイラを使うのでなければ MyPlotEventHandler(func) の代わりに &func とすることができることを // 覚えておいてください #define MY_EVT_PLOT_CLICK(id, func) \ wx__DECLARE_EVT1(MY_PLOT_CLICKED, id, MyPlotEventHandler(func)) // イベント処理のサンプルコード (これらの関数のひとつを使用することになるでしょう。 // もちろん、両方使うことはありません): wxBEGIN_EVENT_TABLE(MyFrame, wxFrame)

source: // (without considering the final NULL)
ja: // (ただし終端の NULL は除く)

source: // Do send it
ja: // 送信する

source: // prints "wxString reports a length of 3 character(s)" on Linux
ja: // Linux では "wxString reports a length of 3 character(s)" と表示される

source: // prints "wxString reports a length of 3 character(s)" on Windows
ja: // Windows では "wxString reports a length of 3 character(s)" と表示される

source: // Do something useful. } MyFrameHandler myFrameHandler; MyFrame::MyFrame() {
ja: // 何か有用なことを行う。 } MyFrameHandler myFrameHandler; MyFrame::MyFrame() {

source: // Do something useful } MyFrame::MyFrame() {
ja: // 何か有用なことを行う } MyFrame::MyFrame() {

source: // when the user selects "Exit" from the menu we should close
ja: // ユーザがメニューから "Exit" を選択したときには終了する必要がある。

source: // Do something useful
ja: // 何か有用なことを行う

source: // Do something useful } MyHandler myHandler; MyFrame::MyFrame() {
ja: // 何か有用なことを行う } MyHandler myHandler; MyFrame::MyFrame() {

source: // copy the data
ja: // データをコピーする

source: // in UTF8 the character U+00E0 is encoded as 0xC3A0
ja: // UTF-8 では U+00E0 は 0xC3A0 と符号化される

source: // U+10300 is "OLD ITALIC LETTER A" and is part of Unicode Plane 1
ja: // U+10300 は "OLD ITALIC LETTER A" で、Unicode Plane 1 の一部である

source: // but enable tracing for the transactions as somehow our changes don't
ja: // しかし、どういうわけか時たま変更のコミットに失敗するため、

source: // in UTF8 it's encoded as 0xF0 0x90 0x8C 0x80
ja: // UTF8 では 0xF0 0x90 0x8C 0x80 として符号化される

source: // accordingly and prevent it from being resized
ja: // ウィンドウのサイズを調整し、

source: // to smaller size }
ja: // より小さくリサイズされないようにする }

source: // ... process error ourselves ...
ja: // ... 自分自身でエラー処理を行なう ...

source: // For a complete list, look into the documentation at wxStreamBase. } // You can also inline all like this. if (in_stream.Read(data, nb_datas).LastError() != wxSTREAM_NOERROR) {
ja: // 完全な一覧は wxStreamBase のドキュメントを参照のこと。 } // このようにインラインにすることもできる。 if (in_stream.Read(data, nb_datas).LastError() != wxSTREAM_NOERROR) {

source: // do something with it }
ja: // なんらかの処理 }

source: // get committed sometimes
ja: // トランザクションのトレースは有効化する

source: // it's a single Unicode code-point encoded as:
ja: // これは単一の Unicode コードポイントとして次のように符号化される:

source: // - a UTF16 surrogate pair under Windows
ja: // - Windows では UTF16 サロゲートペア

source: // Notice that as the event handlers normally are not called from outside
ja: // 通常、イベントハンドラはクラス外から呼ばれることはないため、

source: // move the data
ja: // データを移動する

source: // - a UTF8 multiple-bytes sequence under Linux
ja: // - Linux では UTF8 マルチバイトシーケンス

source: // otherwise wxYES or wxOK button will be default wxOK // return wxID_OK wxCANCEL // return wxID_CANCEL wxHELP // return wxID_HELP wxFORWARD // return wxID_FORWARD wxBACKWARD // return wxID_BACKWARD wxSETUP // return wxID_SETUP wxMORE // return wxID_MORE
ja: // これを指定しない場合、wxYES ボタンか wxOK ボタンがデフォルトになります wxOK // wxID_OK を返却します wxCANCEL // wxID_CANCEL を返却します wxHELP // wxID_HELP を返却します wxFORWARD // wxID_FORWARD を返却します wxBACKWARD // wxID_BACKWARD を返却します wxSETUP // wxID_SETUP を返却します wxMORE // wxID_MORE を返却します

source: // the class, they normally are private.
ja: // 普通は private にします。

source: // Do something. } // You can also get the last number of bytes REALLY put into the buffer. size_t really_read = in_stream.LastRead(); // Ok, moves to the beginning of the stream.
ja: // 処理を行なう。 } // また、バッファへ実際に書き込んだバイト数を取得することもできる。 size_t really_read = in_stream.LastRead(); // Ok、ストリームの先頭へ移動する。

source: // to be public.
ja: // する必要はありません。

source: A wxClient object initiates the client part of a client-server DDE-like (Dynamic Data Exchange) conversation (available in both Windows and Unix).
ja: wxClient オブジェクトは DDE 風 (Dynamic Data Exchange) 通信のクライアント・サーバ通信のクライアント部分を初期化します。(Windows と Unix の両方で利用可能です)

source: A wxDC is a device context onto which graphics and text can be drawn.
ja: wxDC は図形やテキストを描画可能な デバイスコンテキスト です。

source: A glyph is a particular image (usually part of a font) that represents a character or part of a character.
ja: グリフ とは、文字、あるいは文字の一部を表現する特定のイメージです。 (通常はフォントの一部です)

source: A EVT_LEAVE_WINDOW(MyFrame::OnMouseLeave) line in the frame event table has no effect as mouse move (including entering and leaving) events are not propagated up to the parent window (at least not by default).
ja: フレームのイベントテーブル内に EVT_LEAVE_WINDOW(MyFrame::OnMouseLeave) を書いても効果がありません。なぜなら、マウス移動 (フレームへの出入りも含みます) イベントは (少なくともデフォルトでは) 親ウィンドウへ伝播しないためです。

source: A better solution is to write programs in such way that they may be compiled either in ANSI (traditional) mode or in the Unicode one.
ja: より良い解決策としては、(従来の) ANSI モードと Unicode モードのどちらでもコンパイルできるようにプログラムを書くことです。

source: A bitmap created dynamically or loaded from a file can be selected into a memory device context (instance of wxMemoryDC).
ja: 動的に作成した、またはファイルから読み込んだビットマップはメモリデバイスコンテキスト (wxMemoryDC のインスタンス) で選択可能です。

source: A book control is a convenient way of displaying multiple pages of information, displayed one page at...
ja: ブックコントロールは複数のページを持つ情報を表示する際に、一度にひとつのページを表示する便利な手段です。

source: A button is a control that contains a text string, and is one of the most common elements of a GUI...
ja: ボタンはテキストを含んだコントロールであり、もっとも一般的な GUI 要素のひとつです。

source: A class that can handle events from the windowing system.
ja: ウィンドウから送信されるベントを処理可能なクラス。

source: A close window or end session event
ja: ウィンドウの終了、またはセッションの終了イベント

source: A common example of a functor is boost::function<>:
ja: ファンクタの一般的な例は boost::function<> です:

source: A common example of such problem arises with std::fstream class constructor in Microsoft Visual C++ standard library implementation.
ja: この問題の一般的な例は Microsoft Visual C++ 標準ライブラリにおける std::fstream クラスのコンストラクタです。

source: A critical section object is used for exactly the same purpose as a wxMutex.
ja: クリティカルセクションは wxMutex とまったく同じ目的で使用されるオブジェクトです。

source: A cursor is a small bitmap usually used for denoting where the mouse pointer is, with a picture that ...
ja: カーソルは小さな矩形のビットマップで、マウスポインタの位置を表すためにマウスクリックを示す画像付きでよく使用されます。

source: A data string is a fourth element of some messages.
ja: いくつかのメッセージではデータ文字列が 4 番目の要素になります。

source: A dialog box is a window with a title bar and sometimes a system menu, which can be moved around the ...
ja: ダイアログボックスはタイトルバーと、たまにシステムメニューを持つ、移動可能なウィンドウです。

source: A dialog box is similar to a panel, in that it is a window which can be used for placing controls, with the following exceptions:
ja: ダイアログボックスはパネルに似ており、コントロールを配置するために使用するウィンドウですが、以下の例外があります:

source: A dialog initialisation event
ja: ダイアログの初期化イベント

source: A few years ago, a solution was proposed: the Unicode standard.
ja: 数年前にひとつの解決策が提案されました: それが Unicode 規格です。

source: A filter stream has the capability of a normal stream but it can be placed on top of another stream...
ja: フィルタストリームは通常のストリームと同じ機能を持っていますが、他のストリームの上に配置することができます。

source: A flex grid sizer is a sizer which lays out its children in a two-dimensional table with all table fi...
ja: 可変グリッドサイザーは子コントロールを 2 次元の表にレイアウトするサイザーです。同じ行中のセルは同じ高さを持ち、同じ列中のセルは同じ幅を持ちますが、すべての行と列が wxGridSizer のように同じ高さや幅を持つ必要はありません。

source: A frame is a window whose size and position can (usually) be changed by the user.
ja: フレームは (通常は) ユーザがサイズや位置を変更可能なウィンドウです。

source: A grid sizer is a sizer which lays out its children in a two-dimensional table with all table fields ...
ja: グリッドサイザーは子コントロールを 2 次元の表にレイアウトするサイザーで、表中のセルはすべて同じ大きさを持ちます。

source: A handler method in another object.
ja: 別のオブジェクトのハンドラ関数。

source: A joystick event
ja: ジョイスティックイベント

source: A keypress event
ja: キー押下イベント

source: A large number of systems out there still depends on the old 8-bit encodings, hampered by the huge amounts of legacy code still widely deployed.
ja: いまだに多くのシステムは旧来の 8 ビットエンコーディングに依存しており、膨大なレガシーコードがいまだに使用されていることがネックになっています。

source: A macro, wxICON(), is available which creates an icon using an XPM on the appropriate platform, or an icon resource on Windows:
ja: wxICON() マクロを使用すると、適切なプラットフォームでは XPM を、Windows ではアイコンリソースを利用してアイコンを作成することができます:

source: A macro, wxICON, is available which creates an icon using an XPM on the appropriate platform, or an icon resource on Windows.
ja: wxICON マクロを使用すると、適切なプラットフォームでは XPM を、Windows ではアイコンリソースを利用してアイコンを作成することができます。

source: A memory device context provides a means to draw graphics onto a bitmap.
ja: メモリデバイスコンテキストはビットマップ上に描画するための方法を提供します。

source: A menu event
ja: メニューイベント

source: A method in another object.
ja: 別のオブジェクトの関数。

source: A mouse event
ja: マウスイベント

source: A move event
ja: 移動イベント

source: A mutex object is a synchronization object whose state is set to signaled when it is not owned by any...
ja: ミューテックスオブジェクトは同期オブジェクトであり、いずれかのスレッドからも所有されていない場合はシグナル状態に、いずれかのスレッドで所有されている場合は非シグナル状態になります。

source: A paint event
ja: 描画イベント

source: A paint event is sent when a window's contents needs to be repainted.
ja: ペイントイベントはウィンドウのコンテンツを再描画する必要があるときに送信されます。

source: A predefined drop target for dealing with text data.
ja: テキストデータに特化した、定義済みのドロップ先。

source: A printer device context is specific to MSW and Mac, and allows access to any printer with a Windows ...
ja: プリンタデバイスコンテキストは MSW と Mac に特有のデバイスコンテキストで、Windows や Macintosh のドライバを使用してプリンタへアクセスできます。

source: A programmer creating a new validator class should provide the following functionality.
ja: 新しいバリデータクラスを作成する場合、次の機能を提供する必要があります。

source: A range of commonly-used control events.
ja: よく使われる一連のコントロールイベント。

source: A scroll event sent by a scrolled window (not a scroll bar)
ja: (スクロールバーではなく) スクロール可能なウィンドウから送信されるスクロールイベント

source: A size event
ja: リサイズイベント

source: A size event holds information about size change events of wxWindow.
ja: リサイズイベントは wxWindow のサイズ変更イベントに関する情報を保持します。

source: A smart SetSize that will fill in default size components with the window's best size values...
ja: デフォルトサイズをウィンドウの最適サイズの値で補う、賢い SetSize。

source: A special version of wxLogChain which uses itself as the new log target.
ja: wxLogChain の特別版で、自分自身を新しいログターゲットとして使用します。

source: A standard .po file begins with a header like this:
ja: 標準の .po ファイルはこのようなヘッダで始まります:

source: A static function enabling or disabling layout adaptation for all dialogs.
ja: すべてのダイアログに対してレイアウトの適応を有効化・無効化する静的関数です。

source: A static function for setting the current layout adapter object, returning the old adapter...
ja: 現在のレイアウトアダプタオブジェクトを設定し、古いアダプタを返却する静的関数。

source: A surrounding frame is implicitly created.
ja: 周囲を囲むフレームが暗黙的に作成される。

source: A system colour change event
ja: システムカラーの変更イベント

source: A text control allows text to be displayed and edited.
ja: テキストの表示と編集が可能なテキストコントロール。

source: A thread is basically a path of execution through a program.
ja: スレッドはプログラム内の基本的な実行パスです。

source: A tree control presents information as a hierarchy, with items that may be expanded to show further i...
ja: ツリーコントロールでは情報を (項目を展開すると追加の項目が現れる) 階層として表します。

source: A tree event holds information about events associated with wxTreeCtrl objects.
ja: ツリーイベントは wxTreeCtrl オブジェクトに関連するイベントの情報を保持します。

source: A validator constructor is responsible for allowing the programmer to specify the kind of validation required, and perhaps a pointer to a C++ variable that is used for storing the data for the control.
ja: バリデータのコンストラクタでは必要な検証の種類をプログラマが指定できるようにしてください。また、コントロールの値を格納する C++ 変数のポインタもおそらく受け取る必要があります。

source: A validator is an object that can be plugged into a control (such as a wxTextCtrl), and mediates between C++ data and the control, transferring the data in either direction and validating it.
ja: バリデータは (wxTextCtrl などの) コントロールに接続可能なオブジェクトで、C++ のデータとコントロールとを仲介 (双方向のデータ転送と検証) します。

source: A value of more than zero is interpreted in relation to the sum of all stretch factors in the children of the respective sizer, i.e. if two children get a stretch factor of 1, they will get half the extra space each independent of whether one control has a minimal sizer inferior to the other or not.
ja: 0 より大きい値はサイザー内の子コントロールに設定されたすべてのストレッチ係数の合計に基づいて解釈されます。つまり、ふたつの子コントロールのストレッチ係数に 1 を指定した場合、一方のコントロールの最小サイズがもう一方より小さいかどうかによらず 、余剰スペースは二等分されます。

source: A value uniquely identifying the type of the event.
ja: イベントの型を一意に識別する値。

source: A variable, wxConvCurrent, points to the conversion object that the user interface is supposed to use, in the case that the user interface is not Unicode-based (like with GTK+ 1.2).
ja: wxConvCurrent 変数は (GTK+ 1.2 のように) ユーザインタフェースが Unicode ベースでない場合に、ユーザインタフェースで使用する変換オブジェクトを指しています。

source: A window focus event
ja: ウィンドウフォーカスイベント

source: A window or application activation event
ja: ウィンドウまたはアプリケーションのアクティブ化イベント

source: A wxClient object represents the client part of a client-server DDE-like (Dynamic Data Exchange) conv...
ja: wxClient オブジェクトは DDE 風 (Dynamic Data Exchange) 通信のクライアント部分を表しています。

source: A wxClientDC must be constructed if an application wishes to paint on the client area of a window fro...
ja: wxClientDC は EVT_PAINT() イベントハンドラ以外の場所でクライアントエリアを描画する場合に使用する必要があります。

source: A wxConnection object represents the connection between a client and a server.
ja: wxConnection オブジェクトはクライアント・サーバ間のコネクションを表しています。

source: A wxDC is a "device context" onto which graphics and text can be drawn.
ja: wxDC は図形やテキストを描画可能なデバイスコンテキストです。

source: A wxDDEServer object represents the server part of a client-server DDE (Dynamic Data Exchange) conver...
ja: wxDDEServer オブジェクトはクライアント・サーバ DDE (Dynamic Data Exchange) 通信のサーバ部分を表しています。

source: A wxDataFormat is an encapsulation of a platform-specific format handle which is used by the system f...
ja: wxDataFormat はクリップボードやドラッグ・アンド・ドロップに関するプラットフォーム独自の処理を隠蔽するものです。

source: A wxDataObject represents data that can be copied to or from the clipboard, or dragged and dropped...
ja: wxDataObject はクリップボードから/へコピーしたり、ドラッグやドロップしたりすることが可能なデータを表しています。

source: A wxFile performs raw file I/O.
ja: wxFile は低レベルファイル入出力を行います。

source: A wxMemoryBuffer is a useful data structure for storing arbitrary sized blocks of memory...
ja: wxMemoryBuffer は任意のサイズのメモリブロックを格納するのに役立つデータ構造です。

source: A wxPaintDC must be constructed if an application wishes to paint on the client area of a window from...
ja: wxClientDC は EVT_PAINT() イベントハンドラ内でクライアントエリアを描画する場合に使用する必要があります。

source: A wxPoint is a useful data structure for graphics operations.
ja: wxPoint は図形操作のための有用なデータ構造です。

source: A wxScreenDC can be used to paint on the screen.
ja: wxScreenDC はスクリーン上へ描画するときに使用します。

source: A wxServer object represents the server part of a client-server DDE-like (Dynamic Data Exchange) conv...
ja: wxServer オブジェクトは DDE 風 (Dynamic Data Exchange) 通信のサーバ部分を表しています。

source: A wxSize is a useful data structure for graphics operations.
ja: wxSize は図形操作のための有用なデータ構造です。

source: A wxSizer that can lay out items in a virtual grid like a wxFlexGridSizer but in this case explicit p...
ja: wxFlexGridSizer のように子コントロールを仮想のグリッドに配置しますが、wxGBPosition を使用してコントロールを明示的に配置することが可能です。また、wxGBSpan を使用することで、複数の行または列にまたがってコントロールを配置することも可能です。

source: A wxTCPServer object represents the server part of a client-server conversation.
ja: wxTCPServer はクライアント・サーバ通信のサーバ部分を表しています。

source: A wxWidgets application automatically exits when the last top level window (wxFrame or wxDialog), is destroyed.
ja: wxWidgets アプリケーションは最後のトップレベルウィンドウ (wxFrame または wxDialog) が破棄されたときに自動的に終了します。

source: A wxWidgets application does not have a main procedure; the equivalent is the wxApp::OnInit member defined for a class derived from wxApp.
ja: wxWidgets アプリケーションは main 関数を持ちません。それと同等の関数が wxApp を継承したクラスで定義される wxApp::OnInit メンバ関数です。

source: A wxWidgets application does not have a main procedure; the equivalent is the OnInit member defined for a class derived from wxApp.
ja: wxWidgets アプリケーションは main 関数を持ちません。それと同等の関数が wxApp を継承したクラスで定義される OnInit メンバ関数です。

source: A wxWindowDC must be constructed if an application wishes to paint on the whole area of a window (cli...
ja: wxWindowDC はウィンドウ全体 (クライアントエリアと装飾部分) を描画する場合に使用する必要があります。

source: Able to contain the complete set of characters in use in one unified global coding system, it would resolve the character set problems once and for all.
ja: 使用されている文字の一式をひとつの統一的な符号化システムに含めることができるため、これは文字コードに関する問題を完全に解決します。

source: Accessing a UTF-8 string by index can be very inefficient because a single character is represented by a variable number of bytes so that the entire string has to be parsed in order to find the character.
ja: インデックスによる UTF-8 文字列へのアクセスは非常に 非効率的 です。なぜなら、1 文字が可変バイトで表されるため、該当する文字を見つけるために文字列全体を解析する必要があるためです。

source: Acknowledgements
ja: 謝辞

source: Adaptation for wxPropertySheetDialog is always done by simply making the pages scrollable, since wxDialog::GetContentWindow returns the dialog's book control and this is handled by the standard layout adapter.
ja: wxPropertySheetDialog に対する適応は単純にページをスクロール可能にするだけです。なぜなら、 wxDialog::GetContentWindow がダイアログのブックコントロールを返却し、このコントロールが標準のレイアウトアダプタで処理されるためです。

source: Add the mask to the list of allowed masks for wxLogTrace().
ja: wxLogTrace() の許可マスクのリストへマスクを追加します。

source: Additionally, columns and rows can be declared to be stretchable if the sizer is assigned a size different from the one it requested.
ja: 加えて、サイザーの必要とするサイズと異なるサイズを指定した場合に、列や行をリサイズ可能にすることができます。

source: Additionally, in the case of wxWindow you can build a stack (implemented using wxEvtHandler double-linked list) using wxWindow::PushEventHandler():
ja: 加えて wxWindow の場合、wxWindow::PushEventHandler() を使用してスタック (wxEvtHandler の双方向リンクリストで実装されます) を構築することができます:

source: Additionally, you can customize the way full log messages are constructed from the components (such as time stamp, source file information, logging thread ID and so on).
ja: 加えて、ログメッセージを (タイムスタンプ、ソースファイルの情報、スレッドID などの) 部品から構築する方法を完全にカスタマイズすることもできます。

source: Adds a handler to the end of the static list of format handlers.
ja: 形式ハンドラの静的一覧の末尾にハンドラを追加します。

source: Adds a new page.
ja: 新しいページを追加します。

source: Adds an identifier to be regarded as a main button for the non-scrolling area of a dialog...
ja: ダイアログの非スクロール領域にするメインボタンとして扱う識別子を追加します。
